Дошкольное_учреждение83/src/Catalogs/удуДокументыПропускаЗанятий/удуДокументыПропускаЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуДокументыПропускаЗанятий</name>
  <owners>Catalog.удуДети</owners>
  <attributes>
    <name>РодительЧленСемьи</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.удуВидыДокументовПропускаЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдавшийДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПропуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПропуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуДокументыПропускаЗанятий/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура СформироватьНаименованиеДокумента()
	Объект.Наименование = СокрЛП(Объект.ВидДокумента.Наименование) + 
	?(ЗначениеЗаполнено(Объект.НомерДокумента), " № " + СокрЛП(Объект.НомерДокумента), "") + 
	?(ЗначениеЗаполнено(Объект.СерияДокумента), " серия " + СокрЛП(Объект.СерияДокумента), "") + 
	?(ЗначениеЗаполнено(Объект.ДатаВыдачиДокумента), " от " + Формат(Объект.ДатаВыдачиДокумента, "ДЛФ=D"), "");
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СерияДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименованиеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		ФормаВыбораРодителя = ПолучитьФорму("ОбщаяФорма.удуФормаВыбораРодителя");
		ФормаВыбораРодителя.ПараметрРебенок = Объект.Владелец;
		ФормаВыбораРодителя.ВладелецФормы = ЭтаФорма;
		ФормаВыбораРодителя.ОткрытьМодально();				
	Иначе
		Вопрос("Перед выбором родителя необходимо выбрать ребенка!", РежимДиалогаВопрос.ОК);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.удуРодители") Тогда
		Объект.РодительЧленСемьи = ВыбранноеЗначение;
	КонецЕсли;	
КонецПроцедуры
